Revit.Schedules.ScheduleFilter
Revit Schedule Filter

Revit.Schedules.ScheduleFilter.InternalScheduleFilter
Internal reference to the Revit Element

Revit.Schedules.ScheduleFilter.#ctor(Autodesk.Revit.DB.ScheduleFilter)
Reference to the Element
internalScheduleFilter:

Revit.Schedules.ScheduleFilter.ByFieldTypeAndValue(Revit.Schedules.ScheduleField,System.String,System.Object)
Creates Schedule Filter by Schedule Field, Filter Type and value.
field: Schedule Field used for creating filter.
filterType: Filter type. Ex: Equal.
value: Value used by filter for comparison.
Schedule Filter

Revit.Schedules.ScheduleFilter.FilterType
Filter Type

Revit.Schedules.ScheduleFilter.FiledId
Related Schedule Field Id

Revit.Schedules.ScheduleFilter.Value
Value assigned to Schedule Filter